saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.MKV46F16_DFP.11.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKV46F16_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKV46F16</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKV46F16" Dvendor="NXP:11">
      <description>The Kinetis® KV4x family of MCUs is a high-performance solution offering exceptional precision, sensing and control for some of the most demanding applications in motor and power control. Built upon the ARM® Cortex®-M4 core running at 168 MHz with DSP and floating point unit, it features advanced high-speed and high-accuracy peripherals such as high-resolution pulse-width modulation (PWM) with 312 picosecond resolution, dual 12-bit analog-to-digital converters (ADCs) sampling at 4.1 mega samples per second (MSPS), a total of 30 PWM channels for support of multi-motor systems and dual FlexCAN modules. To maximize execution performance a 128-bit wide flash interface is utilized, providing best in class execution from the embedded flash memory. The Kinetis KV4x MCU family is supported by a comprehensive enablement suite from NXP® and third-party resources including reference designs, software libraries and motor configuration tools.</description>
      <device Dname="MKV46F128xxx16">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="168000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKV46F128xxx16_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fffe000" size="0x2000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x4000" access="rw" default="1"/>
        <algorithm name="arm/MKP128_4KB_SECTOR.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKV4x_FAC.FLM" start="0xffff0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
        <debug svd="MKV46F16.xml"/>
        <variant Dvariant="MKV46F128VLH16">
          <compile header="fsl_device_registers.h" define="CPU_MKV46F128VLH16"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV46F128VLH16/MKV46F128xxx16_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV46F128VLL16">
          <compile header="fsl_device_registers.h" define="CPU_MKV46F128VLL16"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV46F128VLL16/MKV46F128xxx16_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKV46F256xxx16">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="168000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKV46F256xxx16_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x040000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fffc000" size="0x4000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x4000" access="rw" default="1"/>
        <algorithm name="arm/MKP256_4KB_SECTOR.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKV4x_FAC.FLM" start="0xffff0000" size="0x00000024" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
        <debug svd="MKV46F16.xml"/>
        <variant Dvariant="MKV46F256VLH16">
          <compile header="fsl_device_registers.h" define="CPU_MKV46F256VLH16"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV46F256VLH16/MKV46F256xxx16_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV46F256VLL16">
          <compile header="fsl_device_registers.h" define="CPU_MKV46F256VLL16"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV46F256VLL16/MKV46F256xxx16_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKV46F128???16" Dvendor="NXP:11"/>
      <accept Dname="MKV46F256???16" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MKV46F16_AND_driver.dmamux_AND_driver.edma">
      <accept Dname="MKV46F128???16" Dvendor="NXP:11"/>
      <accept Dname="MKV46F256???16" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MKV46F16_AND_utility.debug_console">
      <accept Dname="MKV46F128???16" Dvendor="NXP:11"/>
      <accept Dname="MKV46F256???16" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKV46F16_AND_driver.common">
      <accept Dname="MKV46F128???16" Dvendor="NXP:11"/>
      <accept Dname="MKV46F256???16" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKV46F16_AND_component.lists_AND_utility.debug_console">
      <accept Dname="MKV46F128???16" Dvendor="NXP:11"/>
      <accept Dname="MKV46F256???16" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MKV46F16_AND_driver.uart">
      <accept Dname="MKV46F128???16" Dvendor="NXP:11"/>
      <accept Dname="MKV46F256???16" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MKV46F16">
      <accept Dname="MKV46F128???16" Dvendor="NXP:11"/>
      <accept Dname="MKV46F256???16" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MKV46F16_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MKV46F128???16" Dvendor="NXP:11"/>
      <accept Dname="MKV46F256???16" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
